
## Plan Result (management)

[CI link](https://github.com/tqer39/private-lab/actions/runs/2263646180)


<pre><code>Plan: 4 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.deploy-role.aws_iam_policy.github-actions
  * module.deploy-role.aws_iam_role_policy_attachment.github-actions
  * module.oidc-github-actions.aws_iam_openid_connect_provider.github-actions
  * module.deploy-role.module.oidc.aws_iam_role.github-actions


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.deploy-role.aws_iam_policy.github-actions will be created
  + resource "aws_iam_policy" "github-actions" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "management-private-lab-deploy"
      + path      = "/"
      + policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "apigateway:*",
                          + "application-autoscaling:*",
                          + "autoscaling:*",
                          + "cloudformation:*",
                          + "cloudfront:*",
                          + "cloudwatch:*",
                          + "dynamodb:*",
                          + "ec2:*",
                          + "ecr:*",
                          + "ecs:*",
                          + "events:*",
                          + "elasticache:*",
                          + "elasticbeanstalk:*",
                          + "elasticloadbalancing:*",
                          + "es:*",
                          + "firehose:*",
                          + "iam:*",
                          + "kinesis:*",
                          + "kms:*",
                          + "lambda:*",
                          + "logs:*",
                          + "rds:*",
                          + "s3:*",
                          + "sns:*",
                          + "sqs:*",
                          + "ssm:*",
                          + "states:*",
                          + "route53:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowSpecifics"
                    },
                  + {
                      + Action   = [
                          + "iam:*User*",
                          + "iam:*Login*",
                          + "iam:*Group*",
                          + "aws-portal:*",
                          + "budgets:*",
                          + "config:*",
                          + "directconnect:*",
                          + "aws-marketplace:*",
                          + "aws-marketplace-management:*",
                          + "ec2:*ReservedInstances*",
                        ]
                      + Effect   = "Deny"
                      + Resource = "*"
                      + Sid      = "DenySpecifics"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id = (known after apply)
      + tags_all  = {
          + "kkhs:source_path" = "terraform/environments/management/base"
          + "pl:environment"   = "management"
          + "pl:iac"           = "terraform"
          + "pl:owner"         = "tqer39+aws-management@gmail.com"
          + "pl:product"       = "private-lab"
          + "pl:repository"    = "tqer39/private-lab"
        }
    }

  # module.deploy-role.aws_iam_role_policy_attachment.github-actions will be created
  + resource "aws_iam_role_policy_attachment" "github-actions" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "management-private-lab-deploy"
    }

  # module.oidc-github-actions.aws_iam_openid_connect_provider.github-actions will be created
  + resource "aws_iam_openid_connect_provider" "github-actions" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = {
          + "kkhs:source_path" = "terraform/environments/management/base"
          + "pl:environment"   = "management"
          + "pl:iac"           = "terraform"
          + "pl:owner"         = "tqer39+aws-management@gmail.com"
          + "pl:product"       = "private-lab"
          + "pl:repository"    = "tqer39/private-lab"
        }
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # module.deploy-role.module.oidc.aws_iam_role.github-actions will be created
  + resource "aws_iam_role" "github-actions" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:AssumeRoleWithWebIdentity",
                        ]
                      + Condition = {
                          + StringLike = {
                              + "token.actions.githubusercontent.com:sub" = "repo:tqer39/private-lab:*"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::577523824419:oidc-provider/token.actions.githubusercontent.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "management-private-lab-deploy"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "kkhs:source_path" = "terraform/environments/management/base"
          + "pl:environment"   = "management"
          + "pl:iac"           = "terraform"
          + "pl:owner"         = "tqer39+aws-management@gmail.com"
          + "pl:product"       = "private-lab"
          + "pl:repository"    = "tqer39/private-lab"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":7,"Program":"tfcmt","SHA1":"4080e702deb8e941339092d3fb08747edb792c54","Target":"management","Vars":{},"WorkflowName":"Terraform - AWS - Management"} -->